In [1]:
import pandas as pd

In [2]:
raw_input = pd.read_excel('Travel_denormalise.xlsx')

In [3]:
raw_input.head()

,id,Issue_date,Travel_type,Traveler_name,nom,prenom,Supplier_name,OBT_action_code,Tickets_used,Ticket_departure_date,Rang,airport_code,city_name,country,Latitue,Longitude
0,1,2016-01-02,Rail,Bobby Mccoy,Bobby,Mccoy,SNCF,EB,1,2016-01-04,Origine,NaN,TROYES,FRANCE,48.2989,4.0781
1,1,2016-01-02,Rail,Bobby Mccoy,Bobby,Mccoy,SNCF,EB,1,2016-01-04,Destination,NaN,PARIS,FRANCE,48.8566,2.3518
2,2,2016-01-02,Rail,Bobby Mccoy,Bobby,Mccoy,SNCF,EB,1,2016-01-04,Origine,NaN,PARIS,FRANCE,48.8566,2.3518
3,2,2016-01-02,Rail,Bobby Mccoy,Bobby,Mccoy,SNCF,EB,1,2016-01-04,Destination,NaN,TROYES,FRANCE,48.2989,4.0781
4,3,2016-01-02,Rail,Steve Torres,Steve,Torres,SNCF,EB,1,2016-01-15,Origine,NaN,TROYES,FRANCE,48.2989,4.0781

In [10]:
test_df = raw_input[['id', 'city_name', 'Rang', 'Latitue', 'Longitude']]

In [20]:
test2_df = test_df.set_index(['id', 'Rang']).unstack('Rang')

In [26]:
test2_df.columns = [' '.join(col).strip() for col in test2_df.columns.values]

In [28]:
df = raw_input.set_index([column for column in raw_input.columns if column not in ['city_name', 'country', 'Latitue', 'Longitude']]).unstack('Rang')

In [30]:
df.columns = [' '.join(col).strip() for col in df.columns.values]

In [34]:
df.to_excel('input.xlsx')